In [2]:
import pandas as pd
import numpy as np

In [5]:
Day_number=np.arange(1,11)
Steps_walked=[6012,7079,6886,7230,4598,5564,6971,7763,8032,9569]
arr=np.array([Day_number,Steps_walked])
arr=arr.T
arr

array([[   1, 6012],
       [   2, 7079],
       [   3, 6886],
       [   4, 7230],
       [   5, 4598],
       [   6, 5564],
       [   7, 6971],
       [   8, 7763],
       [   9, 8032],
       [  10, 9569]])

In [6]:
new_arr=arr[:,1]+2000
arr[:,1]=new_arr
arr

array([[    1,  8012],
       [    2,  9079],
       [    3,  8886],
       [    4,  9230],
       [    5,  6598],
       [    6,  7564],
       [    7,  8971],
       [    8,  9763],
       [    9, 10032],
       [   10, 11569]])

In [7]:
matched=arr[:,1]>9000
matched
new_arr=arr[matched]
new_arr

array([[    2,  9079],
       [    4,  9230],
       [    8,  9763],
       [    9, 10032],
       [   10, 11569]])

In [9]:
SortedArr=arr[arr[:,1].argsort()]
print('sorted 2D numpy array')
print(SortedArr)

sorted 2D numpy array
[[    5  6598]
 [    6  7564]
 [    1  8012]
 [    3  8886]
 [    7  8971]
 [    2  9079]
 [    4  9230]
 [    8  9763]
 [    9 10032]
 [   10 11569]]

In [11]:
import pandas as pd
import numpy as np
marks_df={'chemistry':[67,90,66,32],
     'physics':[45,92,72,40],
     'mathematics':[50,87,81,12],
     'english':[19,20,72,68]}
marks_df=pd.DataFrame(marks_df,index=['subodh','ram','abdul','john'])
marks_df

        chemistry  physics  mathematics  english
subodh         67       45           50       19
ram            90       92           87       20
abdul          66       72           81       72
john           32       40           12       68

In [12]:
marks_df['Total']=marks_df['chemistry']+marks_df['physics']+marks_df['mathematics']+marks_df['english']
marks_df

        chemistry  physics  mathematics  english  Total
subodh         67       45           50       19    181
ram            90       92           87       20    289
abdul          66       72           81       72    291
john           32       40           12       68    152

In [13]:
marks_df.drop(columns='Total',inplace=True)
marks_df

        chemistry  physics  mathematics  english
subodh         67       45           50       19
ram            90       92           87       20
abdul          66       72           81       72
john           32       40           12       68

In [14]:
new_marks=marks_df+[5,10,10,2]
new_marks

        chemistry  physics  mathematics  english
subodh         72       55           60       21
ram            95      102           97       22
abdul          71       82           91       74
john           37       50           22       70

In [15]:
marks_df.apply(np.sum,axis=0)

chemistry      255
physics        249
mathematics    230
english        179
dtype: int64

In [16]:
marks_df.apply(np.sum,axis=1)

subodh    181
ram       289
abdul     291
john      152
dtype: int64

In [17]:
marks_df.apply(np.sum,axis=1)

subodh    181
ram       289
abdul     291
john      152
dtype: int64

In [19]:
new_marks=marks_df+5
new_marks

        chemistry  physics  mathematics  english
subodh         72       50           55       24
ram            95       97           92       25
abdul          71       77           86       77
john           37       45           17       73

In [22]:
f=marks_df<35
marks_df.mask(f,'Fail')

       chemistry  physics mathematics english
subodh        67       45          50    Fail
ram           90       92          87    Fail
abdul         66       72          81      72
john        Fail       40        Fail      68

In [23]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import matplotlib.cm as cm

In [27]:
data=pd.read_csv('C:/Users/Admin/Downloads/CreditCard_DV.csv')
data

,CLIENTNUM,Attrition_Flag,Customer_Age,Gender,Dependent_count,Education_Level,Income_Category,Credit_Limit,Total_Revolving_Bal,Avg_Purchase,Total_Trans_Amt
0,768805383,Existing Customer,45,M,3,High School,$60K - $80K,12691.0,777,11914.0,1144
1,818770008,Existing Customer,49,F,5,Graduate,Less than $40K,8256.0,864,7392.0,1291
2,713982108,Existing Customer,51,M,3,Graduate,$80K - $120K,3418.0,0,3418.0,1887
3,769911858,Existing Customer,40,F,4,High School,Less than $40K,3313.0,2517,796.0,1171
4,709106358,Existing Customer,40,M,3,Uneducated,$60K - $80K,4716.0,0,4716.0,816
...,...,...,...,...,...,...,...,...,...,...,...
95,719712633,Existing Customer,64,M,1,Graduate,Less than $40K,1709.0,895,814.0,1673
96,772629333,Existing Customer,45,M,3,Graduate,$40K - $60K,3454.0,1200,2254.0,1313
97,720336708,Existing Customer,53,M,3,Doctorate,$40K - $60K,3789.0,1706,2083.0,1609
98,802013583,Existing Customer,56,M,3,College,$120K +,9689.0,2250,7439.0,1158
99,711887583,Attrited Customer,47,M,2,Unknown,$80K - $120K,5449.0,1628,3821.0,836

In [30]:
ax=data.plot("credit_limit"),data("Avg_purchase"),kind="scatter",color='red',marker='o',figsize=(10,7))
ax.set_xlabel("credit_limit")
ax.set_ylabel("avg_purchases")
ax.set_title("credit_limit vs avg_purchase",fontsize=16)

SyntaxError: cannot assign to function call (3800095512.py, line 1)